;=======================================================
; Carbines
;=======================================================

[Carbine_CV_Ghost X2WeaponTemplate]
FriendlyName="Carbine"
FriendlyNamePlural="Carbines"
BriefSummary="Tech: Ballistic\nType: Carbine"
TacticalText="Tech: Ballistic\nType: Carbine"
AbilityDescName="bullpup"

[Carbine_MG_Ghost X2WeaponTemplate]
FriendlyName="Mag Stuttergun"
FriendlyNamePlural="Mag Stutterguns"
BriefSummary="Tech: Magnetic\nType: Carbine"
TacticalText="Tech: Magnetic\nType: Carbine"
AbilityDescName="bullpup"

[Carbine_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Stengun"
FriendlyNamePlural="Laser Stenguns"
BriefSummary="Tech: Laser\nType: Carbine"
TacticalText="Tech: Laser\nType: Carbine"
AbilityDescName="bullpup"

[Carbine_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Quenchgun"
FriendlyNamePlural="Coil Quenchguns"
BriefSummary="Tech: Coil\nType: Carbine"
TacticalText="Tech: Coil\nType: Carbine"
AbilityDescName="bullpup"

[Carbine_BM_Ghost X2WeaponTemplate]
FriendlyName="Plasma Scramgun"
FriendlyNamePlural="Plasma Scramguns"
BriefSummary="Tech: Plasma\nType: Carbine"
TacticalText="Tech: Plasma\nType: Carbine"
AbilityDescName="bullpup"

;=======================================================
; Strike Rifles
;=======================================================

[StrikeRifle_CV_Ghost X2WeaponTemplate]
FriendlyName="Strike Rifle"
FriendlyNamePlural="Strike Rifles"
BriefSummary="Tech: Ballistic\nType: Strike Rifle"
TacticalText="Tech: Ballistic\nType: Strike Rifle"
AbilityDescName="vektor rifle"

[StrikeRifle_MG_Ghost X2WeaponTemplate]
FriendlyName="Mag Strike Rifle"
FriendlyNamePlural="Mag Strike Rifles"
BriefSummary="Tech: Magnetic\nType: Strike Rifle"
TacticalText="Tech: Magnetic\nType: Strike Rifle"
AbilityDescName="vektor rifle"

[StrikeRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Strike Lance"
FriendlyNamePlural="Laser Strike Lances"
BriefSummary="Tech: Laser\nType: Strike Rifle"
TacticalText="Tech: Laser\nType: Strike Rifle"
AbilityDescName="vektor rifle"

[StrikeRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Strike Rifle"
FriendlyNamePlural="Coil Strike Rifles"
BriefSummary="Tech: Coil\nType: Strike Rifle"
TacticalText="Tech: Coil\nType: Strike Rifle"
AbilityDescName="vektor rifle"

[StrikeRifle_BM_Ghost X2WeaponTemplate]
FriendlyName="Plasma Strike Lance"
FriendlyNamePlural="Plasma Strike Lances"
BriefSummary="Tech: Plasma\nType: Strike Rifle"
TacticalText="Tech: Plasma\nType: Strike Rifle"
AbilityDescName="vektor rifle"

;=======================================================
; Battle Rifles
;=======================================================

[BattleRifle_CV_Ghost X2WeaponTemplate]
FriendlyName="Battle Rifle"
FriendlyNamePlural="Battle Rifles"
BriefSummary="Tech: Ballistic\nType: Battle Rifle"
TacticalText="Tech: Ballistic\nType: Battle Rifle"
AbilityDescName="assault rifle"

[BattleRifle_MG_Ghost X2WeaponTemplate]
FriendlyName="Mag Autorifle"
FriendlyNamePlural="Mag Autorifles"
BriefSummary="Tech: Magnetic\nType: Battle Rifle"
TacticalText="Tech: Magnetic\nType: Battle Rifle"
AbilityDescName="assault rifle"

[BattleRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Pulser"
FriendlyNamePlural="Laser Pulsers"
BriefSummary="Tech: Laser\nType: Battle Rifle"
TacticalText="Tech: Laser\nType: Battle Rifle"
AbilityDescName="assault rifle"

[BattleRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Autorifle"
FriendlyNamePlural="Coil Autorifles"
BriefSummary="Tech: Coil\nType: Battle Rifle"
TacticalText="Tech: Coil\nType: Battle Rifle"
AbilityDescName="assault rifle"

[BattleRifle_BM_Ghost X2WeaponTemplate]
FriendlyName="Plasma Cycler"
FriendlyNamePlural="Plasma Cyclers"
BriefSummary="Tech: Plasma\nType: Battle Rifle"
TacticalText="Tech: Plasma\nType: Battle Rifle"
AbilityDescName="assault rifle"

;=======================================================
; Assault Rifles
;=======================================================

[AssaultRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Rifle"
FriendlyNamePlural="Laser Rifles"
BriefSummary="Tech: Laser\nType: Assault Rifle"
TacticalText="Tech: Laser\nType: Assault Rifle"
AbilityDescName="assault rifle"

[AssaultRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Rifle"
FriendlyNamePlural="Coil Rifles"
BriefSummary="Tech: Coil\nType: Assault Rifle"
TacticalText="Tech: Coil\nType: Assault Rifle"
AbilityDescName="assault rifle"

;=======================================================
; Shotguns
;=======================================================

[Shotgun_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Scatterray"
FriendlyNamePlural="Laser Scatterrays"
BriefSummary="Tech: Laser\nType: Shotgun"
TacticalText="Tech: Laser\nType: Shotgun"
AbilityDescName="shotgun"

[Shotgun_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Splitshot"
FriendlyNamePlural="Coil Splitshots"
BriefSummary="Tech: Coil\nType: Shotgun"
TacticalText="Tech: Coil\nType: Shotgun"
AbilityDescName="shotgun"

;=======================================================
; Sniper Rifles
;=======================================================

[SniperRifle_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Sniper Lance"
FriendlyNamePlural="Laser Sniper Lances"
BriefSummary="Tech: Laser\nType: Sniper Rifle"
TacticalText="Tech: Laser\nType: Sniper Rifle"
AbilityDescName="sniper rifle"

[SniperRifle_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Long Rifle"
FriendlyNamePlural="Coil Long Rifles"
BriefSummary="Tech: Coil\nType: Sniper Rifle"
TacticalText="Tech: Coil\nType: Sniper Rifle"
AbilityDescName="sniper rifle"

;=======================================================
; Cannons
;=======================================================

[Cannon_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Cannon"
FriendlyNamePlural="Laser Cannons"
BriefSummary="Tech: Laser\nType: Cannon"
TacticalText="Tech: Laser\nType: Cannon"
AbilityDescName="cannon"

[Cannon_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Cannon"
FriendlyNamePlural="Coil Cannons"
BriefSummary="Tech: Coil\nType: Cannon"
TacticalText="Tech: Coil\nType: Cannon"
AbilityDescName="cannon"

;=======================================================
; Pistols
;=======================================================

[Pistol_LS_Ghost X2WeaponTemplate]
FriendlyName="Laser Pistol"
FriendlyNamePlural="Laser Pistols"
BriefSummary="Tech: Laser\nType: Pistol"
TacticalText="Tech: Laser\nType: Pistol"
UnknownUtilityCategory="Pistol"
AbilityDescName="pistol"

[Pistol_CG_Ghost X2WeaponTemplate]
FriendlyName="Coil Pistol"
FriendlyNamePlural="Coil Pistols"
BriefSummary="Tech: Coil\nType: Pistol"
TacticalText="Tech: Coil\nType: Pistol"
UnknownUtilityCategory="Pistol"
AbilityDescName="pistol"
